// Задание 0: Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное само на себя).
Console.Write("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Квадрат числа: " + a*a);